package com.example.bookdiarymobile.data

/**
 * Перелічення (Enum), що визначає тип екрану, на якому відображається список книг.
 *
 * Використовується в [BookRepository] для динамічного формування SQL-запиту
 * з метою фільтрації книг відповідно до поточного екрану користувача
 * (наприклад, "Прочитані", "Хочу прочитати", "Улюблені").
 */
enum class ScreenType {
    READ, //Представляє екран зі списком прочитаних книг ([BookStatus.READ]).
    TO_READ, // Представляє екран зі списком книг, запланованих до прочитання ([BookStatus.TO_READ]).
    FAVORITES // Представляє екран зі списком улюблених книг (де `isFavorite` має значення `true`).
}